Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: Legislative and regulatory proposals to remove the GST on the construction of new student residences released on November 19, 2024.
fr_fr: Propositions législatives et réglementaires publiées le 19 novembre 2024 concernant l'élimination de la TPS sur la construction de nouvelles résidences étudiantes.

source: Legislative amendments to give effect to the suspension of the Agreement Between the Government of Canada and the Government of the Russian Federation for the Avoidance of Double Taxation and the Prevention of Fiscal Evasion with Respect to Taxes on Income and on Capital under domestic law as of November 18, 2024.
fr_fr: Modifications législatives pour donner effet à la suspension de l'Accord entre le gouvernement du Canada et le gouvernement de la Fédération de la Russie en vue d'éviter les doubles impositions et de prévenir l'évasion fiscale en matière d'impôts sur le revenu et sur la fortune du droit national en vertu du droit national en date du 18 novembre 2024.

source: Legislative and regulatory proposals released on August 12, 2024, including with respect to the following measures: Alternative Minimum Tax (other than changes related to resource expense deductions); Disability Supports Deduction; Charities and Qualified Donees; Registered Education Savings Plans; Avoidance of Tax Debts; Mutual Fund Corporations; Synthetic Equity Arrangements; Manipulation of Bankrupt Status; Accelerated Capital Cost Allowance for Productivity-Enhancing Assets; Accelerated Capital Cost Allowance for Purpose-Built Rental Housing; Withholding for Non-Resident Service Providers; Regulations related to the application of the Enhanced (100-per-cent) GST Rental Rebate to cooperative housing corporations; Clean Electricity Investment Tax Credit; Expanding eligibility under the Clean Technology Investment Tax Credit to support generation of electricity and heat from waste biomass; Proposed expansion of eligibility for the Clean Technology Manufacturing Investment Tax Credit to support Polymetallic Extraction and Processing; Amendments to the Global Minimum Tax Act and the Income Tax Conventions Interpretation Act; Technical tax amendments to the Income Tax Act and the Income Tax Regulations ; and Technical amendments relating to the GST/HST, excise levies and other taxes and charges.
fr_fr: Publications législatives et réglementaires publiées le 12 août 2024, notamment en ce qui concerne les mesures suivantes : Impôt minimum de remplacement (autre que les changements liés aux déductions pour les frais relatifs à des ressources); Déduction pour produits et services de soutien aux personnes handicapées; Organismes de bienfaisance et donataires reconnus; Régimes enregistrés d'épargne-études; Évitement de dettes fiscales; Sociétés de placement à capital variable; Arrangements de capitaux propres synthétiques; Manipulation du statut de faillite; Déduction pour amortissement accéléré — Actifs qui améliorent la productivité; Déduction pour amortissement accéléré — Logements construits expressément pour la location; Retenues d'impôt des fournisseurs de services non-résidents; Règlement relatif à l'application de la bonification (100 %) du remboursement de la TPS pour immeubles d'habitation locatif pour les coopératives d'habitation; Crédit d'impôt à l'investissement pour l'électricité propre; Élargissement de l'admissibilité au crédit d'impôt à l'investissement dans les technologies propres pour encourager la production d'électricité et de chaleur à partir de déchets de biomasse; Élargissement de l'admissibilité au crédit d'impôt pour la fabrication de technologies propres pour encourager l'extraction et la transformation de ressources polymétalliques; Modifications à la Loi sur l'impôt minimum mondial et à la Loi sur l'interprétation des conventions en matière d'impôts sur le revenu; Modifications techniques à la Loi de l'impôt sur le revenu et à son règlement; Modifications techniques liées à la TPS/TVH, aux droits d'accise et à d'autres taxes et redevances.

source: Legislative proposals released on July 12, 2024, related to implementing an opt-in Fuel, Alcohol, Cannabis, Tobacco and Vaping (FACT) value-added sales tax framework for interested Indigenous governments.
fr_fr: Propositions législatives publiées le 12 juillet 2024 relatives à la mise en œuvre d'un cadre à adhésion volontaire pour la perception de taxes de vente à valeur ajoutée sur le carburant, l'alcool, le cannabis, le tabac et les produits de vapotage (CACT) pour les gouvernements autochtones intéressés.

source: The proposed exemption from the Alternative Minimum Tax for certain trusts for the benefit of Indigenous groups announced in Budget 2024.
fr_fr: L'exonération proposée de l'impôt minimum de remplacement pour certaines fiducies au profit de groupes autochtones, annoncée dans le budget de 2024.

source: The proposed increase in the Lifetime Capital Gains Exemption to apply to up to $1.25 million of eligible capital gains announced in Budget 2024.
fr_fr: L'augmentation proposée de l'exonération cumulative des gains en capital, annoncée dans le budget de 2024, pour qu'elle s'applique jusqu'à concurrence de 1,25 million de dollars des gains en capital admissibles.

source: Legislative and regulatory proposals announced in Budget 2024 with respect to a new importation limit for packaged raw leaf tobacco for personal use.
fr_fr: Propositions législatives et réglementaires annoncées dans le budget de 2024 concernant une nouvelle limite à l'importation du tabac en feuilles emballé pour usage personnel.

source: Tax measures to amend the Excise Tax Act , the Air Travellers Security Charge Act , the Excise Act, 2001 and the Select Luxury Items Tax Act to give effect to the proposals relating to non-compliance with information requests and to avoidance of tax debts announced in Budget 2024.
fr_fr: Mesures fiscales visant à modifier la Loi sur la taxe d'accise, la Loi sur le droit pour la sécurité des passagers du transport aérien, la Loi de 2001 sur l'accise et la Loi sur la taxe sur certains biens de luxe pour donner effet aux propositions liées à la non-conformité aux demandes de renseignements et à l'évitement de dettes fiscales annoncées dans le budget de 2024.

source: Legislative and regulatory proposals released on August 4, 2023, including with respect to the following measures: Technical amendments to GST/HST rules for financial institutions; Tax-exempt sales of motive fuels for export; and Revised Luxury Tax draft regulations to provide greater clarity on the tax treatment of luxury items.
fr_fr: Propositions législatives et réglementaires publiées le 4 août 2023, notamment en ce qui concerne les mesures suivantes : Modifications techniques aux règles de la TPS/TVH pour les institutions financières; Ventes exemptes de taxe de carburants moteurs pour l'exportation; Projet de règlement révisé sur la taxe de luxe pour clarifier le traitement fiscal des biens de luxe.

source: Legislative and regulatory proposals released on August 9, 2022, including with respect to the following measures: Technical amendments to the Income Tax Act and Income Tax Regulations ; and Remaining legislative and regulatory proposals relating to the GST/HST, excise levies and other taxes and charges.
fr_fr: Propositions législatives et réglementaires publiées le 9 août 2022, notamment en ce qui concerne les mesures suivantes : Modifications techniques à la Loi de l'impôt sur le revenu et à son règlement; Autres propositions législatives et réglementaires liées à la TPS/TVH, aux droits d'accise et à d'autres taxes et redevances.

source: Legislative amendments to implement the Hybrid Mismatch Arrangements rules announced in Budget 2021.
fr_fr: Propositions législatives pour mettre en œuvre les règles sur les dispositions hybrides annoncées dans le budget de 2021.

source: The income tax measure announced on December 20, 2019, to extend the maturation period of amateur athlete trusts maturing in 2019 by one year, from eight years to nine years.
fr_fr: La mesure liée à l'impôt sur le revenu annoncée le 20 décembre 2019 afin de repousser d'un an l'échéance des fiducies au profit d'un athlète amateur qui arrivent à échéance en 2019, la faisant ainsi passer de huit ans à neuf ans.

source: Budget 2025 also reaffirms the government's commitment to move forward as required with other technical amendments to improve the certainty and integrity of the tax system.
fr_fr: Le budget de 2025 confirme également l'engagement du gouvernement à procéder au besoin à d'autres modifications techniques afin d'améliorer la certitude et l'intégrité du régime fiscal.

source: <<< source: nwmm-amvm-1-en.html >>>
fr_fr: <<< source: nwmm-amvm-1-fr.html >>>

source: Notice of Ways and Means Motion to
fr_fr: Avis de motion de voies et moyens visant à

source: Amend the Income Tax Act and the Income Tax Regulations
fr_fr: modifier la Loi de l'impôt sur le revenu et le Règlement de l'impôt sur le revenu

source: That it is expedient to amend the Income Tax Act (the "Act") and the Income Tax Regulations (the "Regulations") as follows:
fr_fr: Il y a lieu de modifier la Loi de l'impôt sur le revenu (la Loi) et le Règlement de l'impôt sur le revenu (le Règlement) comme suit :

source: 1 (1) The Income Tax Act is amended by adding the following after section 122.92: SUBDIVISION A.7 Personal Support Worker Tax Credit Marginal note: Definitions 122.93 (1) The following definitions apply in this section. eligible health care establishment eligible health care establishment means a hospital, nursing care facility, residential care facility, community care facility for the elderly, home health care establishment and similar regulated health care establishments. ( établissement de soins de santé admissible ) eligible personal support worker eligible personal support worker , for a taxation year, means an individual (a) who performs duties of employment in the capacity of a personal support worker for an eligible health care establishment during the taxation year (in this definition referred to as the "duties for the year"); (b) who, in the course of performing the duties for the year, ordinarily provides one-on-one care and essential support to optimize and maintain another individual's health, well-being, safety, autonomy and comfort consistent with that other individual's health care needs as directed by a regulated health care professional or a provincial or community health organization; and (c) whose main duties of employment, in respect of the duties for the year, include assisting individuals with activities of daily living and mobilization. ( préposé aux services de soutien à la personne admissible ) return of income return of income , filed by an eligible personal support worker for a taxation year, means a return of income (other than a return of income under subsection 70(2) or 104(23), paragraph 128(2)(e) or subsection 150(4)) that is required to be filed for the taxation year or that would be required to be filed if the eligible personal support worker had tax payable under this Part for the taxation year. ( déclaration de revenu ) yearly eligible remuneration yearly eligible remuneration of an individual for a taxation year means the total of all amounts, each of which (a) would be, in the absence of section 8 and paragraph 81(1)(a), the individual's income for the taxation year from an office or employment as an eligible personal support worker for an eligible health care establishment in a province, other than duties performed in Newfoundland and Labrador, the Northwest Territories and British Columbia; and (b) is certified by the individual's employer in the prescribed form and manner to be an amount that satisfies the description under paragraph (a). ( rémunération annuelle admissible ) Marginal note: Deemed overpayment — yearly eligible remuneration (2) An eligible personal support worker, for a taxation year that begins after 2025 and that ends before 2031, who files a return of income for the taxation year and makes a claim under this subsection, is deemed to have paid, at the end of the taxation year, on account of tax payable under this Part for the taxation year, an amount equal to the lesser of (a) $1,100, and (b) 5% of the eligible personal support worker's yearly eligible remuneration for the taxation year.
fr_fr: 1 (1) La Loi de l'impôt sur le revenu est modifiée par adjonction, après l'article 122.92, de ce qui suit : SOUS-SECTION A.7 Crédit d'impôt pour les préposés aux services de soutien à la personne Note marginale : Définitions 122.93 (1) Les définitions qui suivent s'appliquent au présent article. déclaration de revenu déclaration de revenu Déclaration de revenu produite par un préposé aux services de soutien à la personne admissible pour une année d'imposition, sauf celle qui est à produire aux termes des paragraphes 70(2) ou 104(23), de l'alinéa 128(2)e) ou du paragraphe 150(4), qu'un préposé aux services de soutien à la personne admissible est tenu de produire pour une année d'imposition ou qu'il serait tenu de produire s'il avait un impôt à payer en vertu de la présente partie pour l'année. ( return of income ) établissement de soins de santé admissible établissement de soins de santé admissible Hôpital, établissement de soins infirmiers, établissement de soins pour bénéficiaires internes, établissement communautaire de soins pour personnes âgées, établissement de soins de santé à domicile et autres établissements de soins de santé réglementés similaires. ( eligible health care establishment ) préposé aux services de soutien à la personne admissible préposé aux services de soutien à la personne admissible Pour une année d'imposition, s'entend d'un particulier, à la fois : a) qui accomplit des fonctions en sa qualité de préposé aux services de soutien à la personne pour un établissement de soins de santé admissible au cours de l'année d'imposition (appelées « fonctions pour l'année » à la présente définition); b) qui, dans le cadre de l'exécution des fonctions pour l'année, fournit habituellement des soins individuels et un soutien essentiel afin d'optimiser et de maintenir la santé d'un autre particulier, son bien-être, sa sécurité, son autonomie et son confort, selon ses besoins en matière de soins de santé, conformément aux directives d'un professionnel de soins de santé réglementé ou d'un organisme de santé provincial ou communautaire; c) dont les fonctions principales, relativement aux fonctions pour l'année, incluent l'aide aux particuliers dans leurs activités de la vie quotidienne et leur mobilisation. ( eligible personal support worker ) rémunération annuelle admissible rémunération annuelle admissible Relativement à un particulier pour une année d'imposition, la somme de tous les montants qui, à la fois : a) seraient, compte non tenu de l'article 8 et de l'alinéa 81(1)a), le revenu du particulier pour l'année d'imposition tiré d'une charge ou d'un emploi à titre de préposé aux services de soutien à la personne admissible pour un établissement de soins de santé admissible dans une province, à l'exception des fonctions accomplies à Terre-Neuve-et-Labrador, dans les Territoires du Nord-Ouest et en Colombie-Britannique; b) sont attestés par son employeur, dans la forme et selon les modalités prescrites, comme étant des montants visés à l'alinéa a). ( yearly eligible remuneration ) Note marginale : Paiement en trop réputé –– rémunération annuelle admissible (2) Le préposé aux services de soutien à la personne admissible qui produit une déclaration de revenu pour une année d'imposition commençant après 2025 et se terminant avant 2031 et qui fait une demande en vertu du présent paragraphe est réputé avoir payé, à la fin de l'année, au titre de son impôt payable en vertu de la présente partie pour l'année, une somme égale au moins élevé des montants suivants : a) 1 100 $; b) 5 % de la rémunération annuelle admissible du préposé aux services de soutien à la personne admissible pour l'année d'imposition.

source: Marginal note: Effect of bankruptcy (3) For the purpose of this Subdivision, if an individual becomes bankrupt in a particular calendar year (a) despite subsection 128(2), any reference to a taxation year of the individual (other than in this subsection) is deemed to be a reference to the particular calendar year; and (b) the individual's yearly eligible remuneration for the taxation year ending on December 31 of the particular calendar year is deemed to include the individual's yearly eligible remuneration for the taxation year that begins on January 1 of the particular calendar year.
fr_fr: Note marginale : Effet de la faillite (3) Pour l'application de la présente sous-section, si un particulier devient failli au cours d'une année civile donnée : a) malgré le paragraphe 128(2), toute mention (sauf au présent paragraphe) d'une année d'imposition du particulier vaut mention de l'année civile donnée; b) la rémunération annuelle admissible du particulier pour l'année d'imposition se terminant le 31 décembre de l'année civile donnée est réputée comprendre la rémunération annuelle admissible du particulier pour l'année d'imposition qui commence le 1 er janvier de l'année civile donnée.

source: Marginal note: Special rules in the event of death (4) For the purpose of this Subdivision, if an individual dies before the end of a calendar year, any return of income filed by a legal representative of the individual is deemed to be a return of income filed by the individual.
fr_fr: Note marginale : Règles spéciales –– décès (4) Pour l'application de la présente sous-section, si le particulier décède avant la fin d'une année civile, toute déclaration de revenu produite par le représentant légal du particulier est réputée être une déclaration de revenu produite par le particulier.

source: (2) Subsection (1) applies to the 2026 and subsequent taxation years.
fr_fr: (2) Le paragraphe (1) s'applique aux années d'imposition 2026 et suivantes.

source: 2 (1) Paragraph 152(1)(b) of the Act is replaced by the following: (b) the amount of tax, if any, deemed by any of subsections 120(2) or (2.2), 122.5(3) to (3.003), 122.51(2), 122.7(2) or (3), 122.72(1), 122.8(4), 122.9(2), 122.91(1), 122.93(2), 125.4(3), 125.5(3), 125.6(2) or (2.1), 127.1(1), 127.41(3), 127.44(2), 127.45(2), 127.48(2), 127.49(2) or 210.2(3) or (4) to be paid on account of the taxpayer's tax payable under this Part for the year.
fr_fr: 2 (1) L'alinéa 152(1)b) de la même loi est remplacé par ce qui suit : b) le montant d'impôt qui est réputé, en application des paragraphes 120(2) ou (2.2), 122.5(3) à (3.003), 122.51(2), 122.7(2) ou (3), 122.72(1), 122.8(4), 122.9(2), 122.91(1), 122.93(2), 125.4(3), 125.5(3), 125.6(2) ou (2.1), 127.1(1), 127.41(3), 127.44(2), 127.45(2), 127.48(2), 127.49(2) ou 210.2(3) ou (4), avoir été payé au titre de l'impôt payable par le contribuable en vertu de la présente partie pour l'année.

source: (2) Paragraph 152(4.2)(b) of the Act is replaced by the following: (b) redetermine the amount, if any, deemed by any of subsections 120(2) or (2.2), 122.5(3) to (3.003), 122.51(2), 122.7(2) or (3), 122.8(4), 122.9(2), 122.91(1), 122.93(2), 127.1(1), 127.41(3) or 210.2(3) or (4) to be paid on account of the taxpayer's tax payable under this Part for the year or deemed by subsection 122.61(1) to be an overpayment on account of the taxpayer's liability under this Part for the year.
fr_fr: (2) L'alinéa 152(4.2)b) de la même loi est remplacé par ce qui suit : b) déterminer de nouveau l'impôt qui est réputé, par les paragraphes 120(2) ou (2.2), 122.5(3) à (3.003), 122.51(2), 122.7(2) ou (3), 122.8(4), 122.9(2), 122.91(1), 122.93(2), 127.1(1), 127.41(3) ou 210.2(3) ou (4), avoir été payé au titre de l'impôt payable par le contribuable en vertu de la présente partie pour l'année ou qui est réputé, par le paragraphe 122.61(1), être un paiement en trop au titre des sommes dont le contribuable est redevable en vertu de la présente partie pour l'année.

source: (3) Subsections (1) and (2) apply to the 2026 and subsequent taxation years.
fr_fr: (3) Les paragraphes (1) et (2) s'appliquent aux années d'imposition 2026 et suivantes.

source: 3 (1) Subsection 163(2) of the Act is amended by adding the following after paragraph (c.6): (c.7) the amount, if any, by which (i) the amount that would be deemed by subsection 122.93(2) to have been paid for the year by the person if that amount were calculated by reference to the person's claim for the year under that subsection exceeds (ii) the amount that is deemed by that subsection to be paid for the year by the person,
fr_fr: 3 (1) Le paragraphe 163(2) de la même loi est modifié par adjonction, après l'alinéa c.6), de ce qui suit : c.7) l'excédent éventuel du montant visé au sous-alinéa (i) sur le montant visé au sous-alinéa (ii) : (i) le montant qui serait réputé, par le paragraphe 122.93(2), avoir été payé pour l'année par la personne si ce montant était calculé en fonction de la somme demandée par la personne pour l'année en vertu de ce paragraphe, (ii) le montant qui est réputé, par ce paragraphe, avoir été payé pour l'année par la personne;

source: Automated Federal Benefits for Lower-Income Individuals
fr_fr: Prestations fédérales automatisées pour les personnes à faible revenu

source: 1 (1) Subsection 150.1(4) of the Act is replaced by the following: Marginal note: Declaration (4) If a return of income of a taxpayer for a taxation year is filed by way of electronic filing by a particular person (in this subsection referred to as the "filer") other than the person who is required to file the return, or the Minister pursuant to section 150.2, the person who is required to file the return shall make an information return in prescribed form containing prescribed information, retain a copy of it and provide the filer with the information return, and that return and the copy shall be deemed to be a record referred to in section 230 in respect of the filer and the other person.
fr_fr: 1 (1) Le paragraphe 150.1(4) de la même loi est remplacé par ce qui suit : Note marginale : Déclaration (4) Si la déclaration de revenu d'un contribuable pour une année d'imposition est produite par voie électronique par une personne donnée (appelée « déclarant » au présent paragraphe) autre que la personne qui est tenue de la produire ou le ministre en application de l'article 150.2, cette dernière est tenue d'établir une déclaration de renseignements sur formulaire prescrit contenant les renseignements prescrits, d'en conserver une copie et de remettre la déclaration au déclarant. La déclaration et la copie sont réputées être un registre visé à l'article 230 du déclarant et de cette personne.

source: (2) Subsection (1) applies to the 2025 and subsequent taxation years.
fr_fr: (2) Le paragraphe (1) s'applique aux années d'imposition 2025 et suivantes.
